#+TITLE: May 01-May 16, 2020 (16 days)
#+AUTHOR: Rahul Jha
#+EMAIL: rj722@protonmail.com
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+TODO: TODO IN_PROGRESS | DONE DEFERRED
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}

* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:


* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2020-05-01 Fri>
  :wpd-RJ722: 1
  :wpd-sourya: 1
  :END:
** sourya
*** IN_PROGRESS Read "Crafting Interpreters" [0/4]
    :PROPERTIES:
    :ESTIMATED: 16
    :ACTUAL:
    :OWNER: sourya
    :ID: READ.1587227996
    :TASKID: READ.1587227996
    :END:
    :LOGBOOK:
    :END:
    - [ ] Chapter  4  : Scanning               (180m)
    - [ ] Chapter  5  : Representing code      (180m)
    - [ ] Chapter  6  : Parsing expressions    (180m)
    - [ ] Chapter  7  : Evaluating expressions (180m)
** RJ722
*** IN_PROGRESS Read "Roads and Bridges"
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   1.20
    :OWNER: RJ722
    :ID: READ.1588457399
    :TASKID: READ.1588457399
    :END:
    :LOGBOOK:
    CLOCK: [2020-05-11 Mon 19:10]--[2020-05-11 Mon 19:40] =>  0:30
    CLOCK: [2020-05-11 Mon 01:36]--[2020-05-11 Mon 02:18] =>  0:42
    :END:
*** DONE Read "The Cuckoo's egg: Tracking a spy through the maze of computer espionage"
    CLOSED: [2020-05-09 Sat 05:00]
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:   9.72
    :OWNER: RJ722
    :ID: READ.1588457289
    :TASKID: READ.1588457289
    :END:
    :LOGBOOK:
    CLOCK: [2020-05-09 Sat 03:09]--[2020-05-09 Sat 05:00] =>  1:51
    CLOCK: [2020-05-08 Fri 21:00]--[2020-05-08 Fri 21:36] =>  0:36
    CLOCK: [2020-05-08 Fri 00:55]--[2020-05-08 Fri 03:10] =>  2:15
    CLOCK: [2020-05-06 Wed 00:20]--[2020-05-06 Wed 01:05] =>  0:45
    CLOCK: [2020-05-06 Wed 07:19]--[2020-05-06 Wed 07:31] =>  0:12
    CLOCK: [2020-05-06 Wed 02:16]--[2020-05-06 Wed 06:20] =>  4:04
    :END:
